# Homebrew packages to install
# One package per line
# Lines starting with # are comments and will be ignored
# Empty lines are also ignored

# Development tools
gh
jq
tree
htop
bat
fd
ripgrep
fzf
neovim
tmux
zsh

# Additional useful tools
curl
wget
git-lfs
dive
lazygit
lazydocker
helm
kubectl
terraform
awscli
gcloud
docker-compose

# Language servers and formatters
shellcheck
yamllint
hadolint

# Monitoring and debugging
bandwhich
procs
dust
tokei
hyperfine
